{
    "(.*)([I|i]'?m|I am|feeling|have|experiencing)(.*)([aA]nxiety|[aA]nxious)(.*)": [
        "I'm so sorry to hear that you are suffering from anxiety.",
        "I'm sad to hear that you have anxiety.",
        "I understand that having anxiety can be challenging."
    ],
    "(.*)([I|i]'?m|I am|feeling|have|suffering from|experiencing)(.*)([dD]epression|[dD]epressed|[dD]own)(.*)": [
        "I'm so sorry to hear that you are suffering from depression.",
        "I'm sad to hear that you have depression.",
        "Depression is difficult to bear. I'm sorry you're going through this."
    ],
    "(.*)([Hh]ow can [Ii]|[Ww]hat can [Ii] do|[Ii] need|[Aa]ny suggestions|[mM]ethods|[tT]echniques)(.*)(manage|deal (with)?|reduce|cope with|calm down|relax|control)(.*)([aA]nxiety|[sS]tress|[nN]ervousness|[oO]verwhelm(ed)?)(.*)": [
        "One method for dealing with anxiety is deep breathing.",
        "Regular exercise can help manage stress and anxiety.",
        "Mindfulness techniques have been proven to reduce anxiety.",
        "Consider speaking to a healthcare professional for personalized advice.",
        "If you're experiencing ongoing anxiety, it's crucial to seek professional advice for diagnosis and treatment options."
    ],
    "(.*)([Hh]ow can [Ii]|[Ww]hat can [Ii] do|[Ii] need|[Aa]ny suggestions|[mM]ethods|[tT]echniques)(.*)(manage|deal (with)?|reduce|cope with|overcome|handle)(.*)([dD]epression|[dD]epressed|[dD]own|[lL]ow)(.*)": [
        "Seeking professional help is often the first step in managing depression.",
        "Exercise is shown to improve mood and mental well-being, including symptoms of depression.",
        "Mindfulness and meditation techniques can be effective in reducing symptoms of depression.",
        "Dietary changes, such as a balanced diet rich in omega-3 fatty acids and Vitamin D, may help in dealing with depression.",
        "Support from friends and family can be invaluable when you're feeling down.",
        "Some find that talking therapies, such as cognitive-behavioral therapy (CBT), are effective in treating depression.",
        "Medication like antidepressants can be an option, but they should be taken under medical supervision.",
        "Artistic activities like painting or listening to music can sometimes lift mood.",
        "Reducing alcohol and avoiding recreational drugs can have a positive effect on your mental health.",
        "If you're experiencing ongoing depression, it's crucial to seek professional advice for diagnosis and treatment options."
    ],
    "(.*)([wW]hy [dD]o [iI] have|[wW]hy [aA]m [iI]|[wW]hat causes|[wW]hat (is|are) the reason(s)? for|[Ww]hy)(.*)([aA]nxiety|[sS]tress|[nN]ervousness|[wW]orry)(.*)": [
        "Anxiety can be caused by a variety of factors, including stress, hormonal imbalances, or traumatic events.",
        "Certain medications or substances can also induce anxiety as a side effect.",
        "Sometimes anxiety is a symptom of an underlying medical condition.",
        "Genetics can play a role; anxiety disorders often run in families.",
        "Sometimes the cause is a combination of factors, and it's not easy to pinpoint one specific reason.",
        "Chronic worry or fear can sometimes lead to anxiety; cognitive-behavioral therapy (CBT) can help identify root causes.",
        "Lifestyle choices, such as lack of exercise or poor diet, can contribute to anxiety.",
        "In some cases, the cause of anxiety is not clear and may require in-depth medical evaluation.",
        "Mental health conditions like Generalized Anxiety Disorder (GAD) or Panic Disorder can also be the root cause."
    ]
}